---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure
source: html/c86ff3fb-9b54-bd44-6d88-b12798cb07f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure Property

Only single boundary case may have riser with its both ends on boundary.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure { get; }
```